package homework32;

/**
 * 23/11/2023 homework * @author Boris Iurciuc (cohort36)
 */
public class Main01 {
//Написать программу, которая посчитает от 1 до 10.
//В конце выведет "Это всё!"
  public static void main(String[] args) {
    for (int i = 1; i <= 10; i++) {
      System.out.println(i);
    }
    System.out.println("Это все!");
  }
}
